chipskiller/ahrs_test/GD32F3x0_Firmware_Library_V2.6.0/GD32F3x0_Firmware_Library_V2.6.0/GD32F3x0_Firmware_Library_V2.6.0/Template/main.c
/************************ 陀螺静态零偏自动校准 ************************/
/**
 * @brief 设备静止时自动微调Z轴陀螺零偏，抑制温度漂移
 * 仅保存至内存，不写入Flash，上电重置
 */

/************************ 四元数辅助函数 ************************/
static void quat_normalize(void) {
  float norm = sqrtf(quat.w * quat.w + quat.x * quat.x + quat.y * quat.y +
                     quat.z * quat.z);
  if (norm > 0.0001f) {
    quat.w /= norm;
    quat.x /= norm;
    quat.y /= norm;
    quat.z /= norm;
  }
}

static void euler_to_quat(float pitch_deg, float roll_deg, float yaw_deg) {
  float p = pitch_deg * 0.0174533f * 0.5f;
  float r = roll_deg * 0.0174533f * 0.5f;
  float y = yaw_deg * 0.0174533f * 0.5f;

  float cp = cosf(p), sp = sinf(p);
  float cr = cosf(r), sr = sinf(r);
  float cy = cosf(y), sy = sinf(y);

  quat.w = cp * cr * cy + sp * sr * sy;
  quat.x = sp * cr * cy - cp * sr * sy;
  quat.y = cp * sr * cy + sp * cr * sy;
  quat.z = cp * cr * sy - sp * sr * cy;

  quat_normalize();
}

/************************ 姿态解算算法 ************************/
/**
 * @brief 姿态解算（四元数版）
 * 内部使用四元数进行姿态更新，避免万向节锁
 * 输出仍然是欧拉角（pitch, roll, yaw_now）
 */
void attitude_calc_6axis(float *ax, float *ay, float *az, float *gx, float *gy,
                         float *gz, float *temp) {
  static uint8_t first_run = 1;
  static float gx_bias = 0.0f, gy_bias = 0.0f;
  static float gx_sum = 0.0f, gy_sum = 0.0f, gz_sum = 0.0f;
  static uint16_t init_cnt = 0;
  static float ix = 0.0f, iy = 0.0f, iz = 0.0f;

  if (first_run) {
    gx_sum += *gx;
    gy_sum += *gy;
    gz_sum += *gz;
    init_cnt++;

    if (init_cnt >= 200) {
      gx_bias = gx_sum / 200.0f;
      gy_bias = gy_sum / 200.0f;
      gyro_bias.gz_bias = gz_sum / 200.0f;
      gyro_bias.temp_ref = *temp;

      float accel_pitch = atan2f(-*ax, sqrtf(*ay * *ay + *az * *az)) * 57.3f;
      float accel_roll = atan2f(*ay, *az) * 57.3f;
      euler_to_quat(accel_pitch, accel_roll, 0.0f);

      first_run = 0;
    } else {
      float accel_pitch = atan2f(-*ax, sqrtf(*ay * *ay + *az * *az)) * 57.3f;
      float accel_roll = atan2f(*ay, *az) * 57.3f;
      att.pitch = accel_pitch;
      att.roll = accel_roll;
      att.yaw_now = 0.0f;
      return;
    }
  }

  float gx_comp = *gx - gx_bias;
  float gy_comp = *gy - gy_bias;
  float gz_comp = *gz - gyro_bias.gz_bias;

  static uint16_t stable_cnt = 0;
  uint8_t is_stable = (fabsf(gx_comp) < 2.0f) && (fabsf(gy_comp) < 2.0f) &&
                      (fabsf(gz_comp) < 2.0f);

  if (is_stable) {
    stable_cnt++;
  } else {
    stable_cnt = 0;
    ix = 0.0f;
    iy = 0.0f;
    iz = 0.0f;
  }

  float q0 = quat.w, q1 = quat.x, q2 = quat.y, q3 = quat.z;

  float gx_rad = gx_comp * 0.0174533f;
  float gy_rad = gy_comp * 0.0174533f;
  float gz_rad = gz_comp * 0.0174533f;

  float half_dt = DT * 0.5f;

  float dq0 = (-q1 * gx_rad - q2 * gy_rad - q3 * gz_rad) * half_dt;
  float dq1 = (q0 * gx_rad + q2 * gz_rad - q3 * gy_rad) * half_dt;
  float dq2 = (q0 * gy_rad - q1 * gz_rad + q3 * gx_rad) * half_dt;
  float dq3 = (q0 * gz_rad + q1 * gy_rad - q2 * gx_rad) * half_dt;

  float acc_norm = sqrtf(*ax * *ax + *ay * *ay + *az * *az);
  if (stable_cnt > 10 && acc_norm > 0.85f && acc_norm < 1.15f) {
    float ax_n = *ax / acc_norm;
    float ay_n = *ay / acc_norm;
    float az_n = *az / acc_norm;

    float vx = 2.0f * (q1 * q3 - q0 * q2);
    float vy = 2.0f * (q0 * q1 + q2 * q3);
    float vz = q0 * q0 - q1 * q1 - q2 * q2 + q3 * q3;

    float ex = ay_n * vz - az_n * vy;
    float ey = az_n * vx - ax_n * vz;
    float ez = ax_n * vy - ay_n * vx;

    const float Kp = 0.5f;
    const float Ki = 0.001f;

    ix += ex * Ki;
    iy += ey * Ki;
    iz += ez * Ki;

    dq1 += (ex * Kp + ix) * half_dt;
    dq2 += (ey * Kp + iy) * half_dt;
    dq3 += (ez * Kp + iz) * half_dt;
  }

  quat.w += dq0;
  quat.x += dq1;
  quat.y += dq2;
  quat.z += dq3;

  quat_normalize();

  if (stable_cnt > 100) {
    gx_bias = gx_bias * 0.999f + *gx * 0.001f;
    gy_bias = gy_bias * 0.999f + *gy * 0.001f;
    gyro_bias.gz_bias = gyro_bias.gz_bias * 0.999f + *gz * 0.001f;
  }

  q0 = quat.w;
  q1 = quat.x;
  q2 = quat.y;
  q3 = quat.z;

  float vx = 2.0f * (q1 * q3 - q0 * q2);
  float vy = 2.0f * (q0 * q1 + q2 * q3);
  float vz = q0 * q0 - q1 * q1 - q2 * q2 + q3 * q3;

  att.pitch = atan2f(-vx, sqrtf(vy * vy + vz * vz)) * 57.3f;
  att.roll = atan2f(vy, vz) * 57.3f;

  att.yaw_now += gz_comp * DT;

  while (att.yaw_now > 180.0f)
    att.yaw_now -= 360.0f;
  while (att.yaw_now < -180.0f)
    att.yaw_now += 360.0f;
}

/**
 * @brief 夜间9轴融合解算（无大车干扰，地磁缓慢修正Yaw积分漂移）
 */
void attitude_calc_9axis(void) {
  attitude_calc_6axis(&icm_raw.ax, &icm_raw.ay, &icm_raw.az, &icm_raw.gx,
                      &icm_raw.gy, &icm_raw.gz, &icm_raw.temp);

  // 磁力计修正：仅在夜间模式、静止且无地磁干扰时执行
  if (day_mode == 0 && mag_disturb_flag == 0) {
    float pitch_rad = att.pitch * 0.0174533f;
    float cos_p = cosf(pitch_rad);

    if (fabsf(cos_p) > 0.15f) {
      float roll_rad = att.roll * 0.0174533f;
      float sin_p = sinf(pitch_rad);
      float cos_r = cosf(roll_rad);
      float sin_r = sinf(roll_rad);

      float mx_h = mag_raw.mx * cos_p + mag_raw.mz * sin_p;
      float my_h = mag_raw.mx * sin_r * sin_p + mag_raw.my * cos_r -
                   mag_raw.mz * sin_r * cos_p;

      float mag_yaw = atan2f(my_h, mx_h) * 57.3f;
      float yaw_err = mag_yaw - att.yaw_now;
      if (yaw_err > 180.0f)
        yaw_err -= 360.0f;
      if (yaw_err < -180.0f)
        yaw_err += 360.0f;

      att.yaw_now += yaw_err * 0.01f;
    }
  }
}

/************************ GD32 Flash读写（存储安装标定零点）
 * ************************/
/**
 * @brief Flash读取，直接映射地址读取
 */
void flash_read(uint32_t addr, void *data, uint16_t len) {
  memcpy(data, (void *)addr, len);
}

/**
 * @brief Flash页擦除+字写入
 */
void flash_write(uint32_t addr, void *data, uint16_t len) {
  uint32_t page_addr = addr - (addr % FLASH_PAGE_SIZE);
  uint32_t *src = (uint32_t *)data;
  uint16_t word_cnt = len / 4U;

  fmc_unlock();
  fmc_page_erase(page_addr);
  for (uint16_t i = 0; i < word_cnt; i++) {
    fmc_word_program(addr + i * 4, src[i]);
  }
  fmc_lock();
}

/**
 * @brief 现场安装标定函数，采集500帧取平均保存基准零点
 * 设备安装调平后调用一次，断电永久保存
 */
void save_install_zero_point(void) {
  float yaw_sum = 0.0f, pit_sum = 0.0f, rol_sum = 0.0f;
  // 连续采集5秒数据取平均，消除瞬时抖动
  for (uint16_t i = 0; i < 500; i++) {
    icm42670_get_raw_data();
    attitude_calc_6axis(&icm_raw.ax, &icm_raw.ay, &icm_raw.az, &icm_raw.gx,
                        &icm_raw.gy, &icm_raw.gz, &icm_raw.temp);
    yaw_sum += att.yaw_now;
    pit_sum += att.pitch;
    rol_sum += att.roll;
    delay_ms(10);
  }
  // 保存安装基准零点
  att.yaw_base = yaw_sum / 500.0f;
  att.pitch_base = pit_sum / 500.0f;
  att.roll_base = rol_sum / 500.0f;
  gyro_bias.temp_ref = icm_raw.temp;

  // 双分区备份，防止存储损坏丢失零点
  flash_write(FLASH_ZONE_A, &att, sizeof(attitude_info_t));
  flash_write(FLASH_ZONE_B, &att, sizeof(attitude_info_t));
  flash_write(FLASH_GYRO_BIAS, &gyro_bias, sizeof(gyro_bias_t));
}

/**
 * @brief 上电加载安装标定零点
 */
void load_install_zero_point(void) {
  flash_read(FLASH_ZONE_A, &att, sizeof(attitude_info_t));
  flash_read(FLASH_GYRO_BIAS, &gyro_bias, sizeof(gyro_bias_t));

  if (isnan(att.pitch_base) || isnan(att.yaw_now) || att.pitch_base > 1000.0f ||
      att.pitch_base < -1000.0f) {
    att.pitch = 0.0f;
    att.roll = 0.0f;
    att.pitch_base = 0.0f;
    att.roll_base = 0.0f;
    att.yaw_base = 0.0f;
    att.yaw_now = 0.0f;
    gyro_bias.gz_bias = 0.0f;
    gyro_bias.temp_ref = 25.0f;
    printf("Flash data invalid, using default zero point!\n");
  }
}

/************************ RS485串口上报函数 ************************/
/**
 * @brief 串口发送字符串
 */
void usart_send_string(char *str) {
  uint16_t len = strlen(str);
  for (uint16_t i = 0; i < len; i++) {
    while (usart_flag_get(USART_RS485, USART_FLAG_TBE) == RESET)
      ;
    usart_data_transmit(USART_RS485, str[i]);
  }
  while (usart_flag_get(USART_RS485, USART_FLAG_TC) == RESET)
    ;
}

/**
 * @brief 发送报警信息
 * @param fault_type:0x01倾斜故障 0x02旋转故障 0x03同时故障
 */
void send_alarm_info(uint8_t fault_type, float pit, float rol, float yaw) {
  static uint16_t alarm_print_cnt = 0;
  alarm_print_cnt++;
  if (alarm_print_cnt >= 100) {
    char buf[64] = {0};
    sprintf(buf, "FAULT:%d,P=%.1f,R=%.1f,Y=%.1f\r\n", fault_type, pit, rol,
            yaw);
    printf("%s", buf);
    alarm_print_cnt = 0;
  }
}

/************************ 昼夜模式切换（RTC小时判定） ************************/
void update_day_night_mode(uint8_t rtc_hour) {
  // 6点~22点白天6轴模式，其余夜间9轴融合
  if (rtc_hour >= 6 && rtc_hour < 22)
    day_mode = 1;
  else
    day_mode = 0;
}

/************************ 主循环调度函数（10ms定时调用）
 * ************************/
/**
 * @brief 定时10ms执行一次，传入RTC当前小时
 */
void imu_main_loop(uint8_t rtc_hour) {
  // 更新昼夜工作模式
  // printf("main loop\n");
  // usart_interrupt_enable(USART0, USART_INT_TBE);
  update_day_night_mode(rtc_hour);

  // 采集传感器原始数据
  icm42670_get_raw_data();
  qmc5883p_get_raw_data();
  // 检测前后地磁向量模长，参数值判断磁场是否被干扰
  mag_disturb_detect();

  // 分时姿态解算
  // if (day_mode == 1)
  attitude_calc_6axis(&icm_raw.ax, &icm_raw.ay, &icm_raw.az, &icm_raw.gx,
                      &icm_raw.gy, &icm_raw.gz, &icm_raw.temp);
  // else
  //     attitude_calc_9axis();

