chipskiller/ahrs_test/GD32F3x0_Firmware_Library_V2.6.0/GD32F3x0_Firmware_Library_V2.6.0/GD32F3x0_Firmware_Library_V2.6.0/Template/main.c
  // 计算当前角度相对安装零点的偏移量
  float yaw_offset = fabsf(att.yaw_now - att.yaw_base);
  if (yaw_offset > 180.0f)
    yaw_offset = 360.0f - yaw_offset;
  float pit_offset = fabsf(att.pitch - att.pitch_base);
  float rol_offset = fabsf(att.roll - att.roll_base);

  uint8_t trigger_alarm = 0;
  // 任意轴偏移超过10°触发故障判定
  if (pit_offset >= ANGLE_ALARM_THRESHOLD ||
      rol_offset >= ANGLE_ALARM_THRESHOLD ||
      yaw_offset >= ANGLE_ALARM_THRESHOLD) {
    trigger_alarm = 1;
  }

  // 2s防抖滤波，瞬时震动不报警
  if (trigger_alarm == 1) {
    alarm_filter_cnt++;
    if (alarm_filter_cnt > ALARM_FILTER_CNT) {
      uint8_t fault_type = 0;
      // X/Y轴倾斜故障标记
      if (pit_offset >= ANGLE_ALARM_THRESHOLD ||
          rol_offset >= ANGLE_ALARM_THRESHOLD)
        fault_type |= 0x01;
      // Z轴绕灯杆旋转故障标记
      if (yaw_offset >= ANGLE_ALARM_THRESHOLD)
        fault_type |= 0x02;
      // send_alarm_info(fault_type, att.pitch, att.roll, att.yaw_now);
      alarm_filter_cnt = ALARM_FILTER_CNT;
    }
  } else {
    alarm_filter_cnt = 0;
  }
}

/************************ 系统总初始化入口 ************************/
/**
 * @brief 传感器系统初始化
 * 外部需提前初始化：GPIO、I2C0/I2C1、USART1、Systick、RTC、定时器
 */
void imu_system_init(void) {
  icm42670_init();
  qmc5883p_init();
  load_install_zero_point(); // 上电加载安装标定零点
}

// ## 外部补充初始化说明（需要自行添加）
// 1. `delay_ms()`：基于Systick实现毫秒延时函数；
// 2. I2C0、I2C1 GPIO+外设初始化；
// 3. USART1串口初始化（RS485收发）；
// 4. 定时器10ms中断，循环调用 `imu_main_loop(rtc_hour)`；
// 5. RTC时钟读取小时，传入主循环；
// 6. 上位机下发标定指令时调用 `save_install_zero_point()` 保存安装零点。

// ## 核心业务逻辑亮点
// 1.
// **大车磁场干扰规避**：白天车流高峰自动关闭地磁航向融合，仅用陀螺积分计算绕杆旋转，不会因货车金属车体造成角度跳变误报警；
// 2.
// **三轴统一报警**：俯仰X、横滚Y、旋转Z任意一轴偏移＞10°，持续2秒稳定后上报，区分倾斜/旋转两种故障码；
// 3. **断电保存标定零点**：Flash双备份存储安装基准，设备拆装后无需重新标定；
// 4. **陀螺温漂抑制**：设备静止时自动平滑更新Z轴零偏，长期运行角度漂移小；
// 5.
// **夜间漂移修正**：夜间车流稀少，地磁缓慢修正陀螺长时间积分误差，保证长期精度。

void com_usart_init(void) {
  // /* enable GPIO clock */
  // rcu_periph_clock_enable(RCU_GPIOA);
  // /* enable USART clock */
  // rcu_periph_clock_enable(RCU_USART0);

  // /* connect port to USART TX */
  // gpio_af_set(GPIOA, GPIO_AF_1, GPIO_PIN_9);

  // /* connect port to USART RX */
  // gpio_af_set(GPIOA, GPIO_AF_1, GPIO_PIN_10);

  // /* configure USART TX as alternate function push-pull */
  // gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_9);
  // gpio_output_options_set(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_10MHZ,
  // GPIO_PIN_9);

  // /* configure USART RX as alternate function push-pull */
  // gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_10);
  // gpio_output_options_set(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_10MHZ,
  // GPIO_PIN_10);
  // /* USART configure */
  // usart_deinit(USART0);
  // usart_word_length_set(USART0, USART_WL_8BIT);
  // usart_stop_bit_set(USART0, USART_STB_1BIT);
  // usart_parity_config(USART0, USART_PM_NONE);
  // usart_baudrate_set(USART0, 115200U);
  // usart_receive_config(USART0, USART_RECEIVE_ENABLE);
  // usart_transmit_config(USART0, USART_TRANSMIT_ENABLE);

  // usart_enable(USART0);

  /* enable GPIO clock */
  rcu_periph_clock_enable(RCU_GPIOA);
  /* enable USART clock */
  rcu_periph_clock_enable(RCU_USART0);

  /* connect port to USART TX */
  gpio_af_set(GPIOA, GPIO_AF_1, GPIO_PIN_9);

  /* connect port to USART RX */
  gpio_af_set(GPIOA, GPIO_AF_1, GPIO_PIN_10);

  /* configure USART TX as alternate function push-pull */
  gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_9);
  gpio_output_options_set(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_10MHZ, GPIO_PIN_9);

  /* configure USART RX as alternate function push-pull */
  gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_10);
  gpio_output_options_set(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_10MHZ, GPIO_PIN_10);

  /* configure USART */
  usart_deinit(USART0);
  usart_word_length_set(USART0, USART_WL_8BIT);
  usart_stop_bit_set(USART0, USART_STB_1BIT);
  usart_parity_config(USART0, USART_PM_NONE);
  usart_baudrate_set(USART0, 115200U);
  usart_receive_config(USART0, USART_RECEIVE_ENABLE);
  usart_transmit_config(USART0, USART_TRANSMIT_ENABLE);
  usart_enable(USART0);
}

void rcu_config(void) { rcu_periph_clock_enable(RCU_GPIOA); }

void gpio_config(void) {
  gpio_af_set(GPIOA, GPIO_AF_1, GPIO_PIN_0);
  gpio_af_set(GPIOA, GPIO_AF_1, GPIO_PIN_1);
  gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_0);
  gpio_output_options_set(GPIOA, GPIO_OTYPE_OD, GPIO_OSPEED_50MHZ, GPIO_PIN_0);
  gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_1);
  gpio_output_options_set(GPIOA, GPIO_OTYPE_OD, GPIO_OSPEED_50MHZ, GPIO_PIN_1);
}

/*!
    \brief      configure the I2C0 interfaces
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_config(void) { soft_i2c_init(); }

void i2c_test(void) {
  printf("Soft I2C test with ACK detection...\n");

  soft_i2c_init();

  for (uint32_t j = 0; j < 5; j++) {
    soft_i2c_start();
    uint8_t ack = soft_i2c_send_byte(0xD0);
    printf("Try %lu: Send addr 0xD0, ack=%u (%s)\n", j, ack,
           ack == 0 ? "ACK received" : "NACK");
    soft_i2c_stop();
    delay_ms(50);
  }

  printf("Soft I2C test done!\n");
}

#define SOFT_I2C_SCL_PIN GPIO_PIN_0
#define SOFT_I2C_SDA_PIN GPIO_PIN_1
#define SOFT_I2C_PORT GPIOA

#define SCL_H() gpio_bit_set(SOFT_I2C_PORT, SOFT_I2C_SCL_PIN)
#define SCL_L() gpio_bit_reset(SOFT_I2C_PORT, SOFT_I2C_SCL_PIN)
#define SDA_H() gpio_bit_set(SOFT_I2C_PORT, SOFT_I2C_SDA_PIN)
#define SDA_L() gpio_bit_reset(SOFT_I2C_PORT, SOFT_I2C_SDA_PIN)
#define SDA_IN() gpio_input_bit_get(SOFT_I2C_PORT, SOFT_I2C_SDA_PIN)

void soft_i2c_init(void) {
  rcu_periph_clock_enable(RCU_GPIOA);

  gpio_mode_set(GPIOA, GPIO_MODE_OUTPUT, GPIO_PUPD_PULLUP,
                GPIO_PIN_0 | GPIO_PIN_1);
  gpio_output_options_set(GPIOA, GPIO_OTYPE_OD, GPIO_OSPEED_50MHZ,
                          GPIO_PIN_0 | GPIO_PIN_1);

  SCL_H();
  SDA_H();
  delay_ms(10);
}

void soft_i2c_start(void) {
  SDA_H();
  SCL_H();
  delay_us(5);
  SDA_L();
  delay_us(5);
  SCL_L();
  delay_us(5);
}

void soft_i2c_stop(void) {
  SDA_L();
  SCL_H();
  delay_us(5);
  SDA_H();
  delay_us(5);
}

uint8_t soft_i2c_send_byte(uint8_t byte) {
  uint8_t i;

  for (i = 0; i < 8; i++) {
    SCL_L();
    delay_us(3);
    if (byte & 0x80) {
      SDA_H();
    } else {
      SDA_L();
    }
    delay_us(2);
    SCL_H();
    delay_us(5);
    byte <<= 1;
  }

  SCL_L();
  delay_us(3);
  SDA_H();
  delay_us(2);
  SCL_H();
  delay_us(5);

