chipskiller/ahrs_test/GD32F3x0_Firmware_Library_V2.6.0/GD32F3x0_Firmware_Library_V2.6.0/GD32F3x0_Firmware_Library_V2.6.0/Template/main.c
  uint8_t ack = SDA_IN();

  SCL_L();
  delay_us(5);

  return (ack == 0) ? 0 : 1;
}

uint8_t soft_i2c_read_byte(uint8_t ack) {
  uint8_t i, byte = 0;

  SDA_H();

  for (i = 0; i < 8; i++) {
    SCL_L();
    delay_us(5);
    SCL_H();
    delay_us(3);
    byte <<= 1;
    if (SDA_IN()) {
      byte |= 0x01;
    }
    delay_us(2);
  }

  SCL_L();
  delay_us(3);
  if (ack) {
    SDA_L();
  } else {
    SDA_H();
  }
  delay_us(2);
  SCL_H();
  delay_us(5);

  SCL_L();
  delay_us(5);

  return byte;
}

void timer_config(void) {
  timer_parameter_struct timer_initpara;

  /* 1. 使能 TIMER1 时钟 */
  rcu_periph_clock_enable(RCU_TIMER1);

  /* 2. 复位 TIMER1 */
  timer_deinit(TIMER1);

  /* 3. 配置 TIMER1 时基单元 */
  timer_struct_para_init(&timer_initpara);
  timer_initpara.prescaler =
      8400 - 1; // 预分频值 (系统时钟84MHz，分频后为10kHz)
  timer_initpara.alignedmode = TIMER_COUNTER_EDGE;    // 边缘对齐模式
  timer_initpara.counterdirection = TIMER_COUNTER_UP; // 向上计数模式
  timer_initpara.period = 100 - 1; // 自动重装载值 (100个计数周期 = 10ms)
  timer_initpara.clockdivision = TIMER_CKDIV_DIV1; // 时钟分频
  timer_initpara.repetitioncounter = 0;            // 重复计数器设为0
  timer_init(TIMER1, &timer_initpara);

  /* 4. 使能 TIMER1 更新中断 */
  timer_interrupt_enable(TIMER1, TIMER_INT_UP);

  /* 5. 配置 NVIC 中断优先级并使能中断 */
  nvic_irq_enable(TIMER1_IRQn, 0, 1);

  /* 6. 启动定时器 */
  timer_enable(TIMER1);
}

int main(void) {
  systick_config();
  com_usart_init();
  printf("Hellow word!\n");
  // sprintf(transmitter_buffer, "HELLO_world!\n");
  // usart_interrupt_enable(USART0, USART_INT_TBE);
  // delay_1ms(10);

  // txcount = 0;
  // usart_interrupt_enable(USART0, USART_INT_TBE);
  // printf("hello_word");
  /* configure RCU */
  rcu_config();
  /* configure GPIO */
  gpio_config();
  /* configure I2C */
  i2c_config();
  printf("I2C init done!\n");

  // i2c_test();

  // // soft_i2c_test();

  // gpio_config();
  // i2c_config();

  // i2c_test();

  imu_system_init();
  timer_config();
  printf("timer init done!\n");
  static uint32_t debug_cnt = 0;
  while (1) {
    if (imu_loop_flag) {
      imu_main_loop(12);
      imu_loop_flag = 0;

      debug_cnt++;
      if (debug_cnt % 1 == 0) {
        printf("P=%.4f,R=%.4f,Y=%.4f\r\n", att.pitch, att.roll, att.yaw_now);
      }
    }
  }
  return 0;
}

// #include "gd32f3x0.h"
// #include "stdio.h"
// #include "systick.h"

// #define delay_ms(x) delay_1ms(x)

// void com_usart_init(void)
// {
//     rcu_periph_clock_enable(RCU_GPIOA);
//     rcu_periph_clock_enable(RCU_USART0);

//     gpio_af_set(GPIOA, GPIO_AF_1, GPIO_PIN_9);
//     gpio_af_set(GPIOA, GPIO_AF_1, GPIO_PIN_10);

//     gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_9);
//     gpio_output_options_set(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_10MHZ,
//     GPIO_PIN_9);

//     gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_10);
//     gpio_output_options_set(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_10MHZ,
//     GPIO_PIN_10);

//     usart_deinit(USART0);
//     usart_word_length_set(USART0, USART_WL_8BIT);
//     usart_stop_bit_set(USART0, USART_STB_1BIT);
//     usart_parity_config(USART0, USART_PM_NONE);
//     usart_baudrate_set(USART0, 115200U);
//     usart_receive_config(USART0, USART_RECEIVE_ENABLE);
//     usart_transmit_config(USART0, USART_TRANSMIT_ENABLE);
//     usart_enable(USART0);
// }

// void timer_config(void)
// {
//     timer_parameter_struct timer_initpara;

//     rcu_periph_clock_enable(RCU_TIMER1);
//     timer_deinit(TIMER1);

//     timer_struct_para_init(&timer_initpara);
//     timer_initpara.prescaler = 8400 - 1;
//     timer_initpara.alignedmode = TIMER_COUNTER_EDGE;
//     timer_initpara.counterdirection = TIMER_COUNTER_UP;
//     timer_initpara.period = 10000 - 1;
//     timer_initpara.clockdivision = TIMER_CKDIV_DIV1;
//     timer_initpara.repetitioncounter = 0;
//     timer_init(TIMER1, &timer_initpara);

//     timer_interrupt_enable(TIMER1, TIMER_INT_UP);
//     nvic_irq_enable(TIMER1_IRQn, 0, 1);
//     timer_enable(TIMER1);
// }

// volatile uint32_t timer_count = 0;

// void TIMER1_IRQHandler(void)
// {
//     if (timer_interrupt_flag_get(TIMER1, TIMER_INT_FLAG_UP) == SET)
//     {
//         timer_interrupt_flag_clear(TIMER1, TIMER_INT_FLAG_UP);
//         timer_count++;
//     }
// }

// void main(void)
// {
//     systick_config();

//     printf("Step 1: Initializing USART...\n");
//     com_usart_init();
//     printf("Step 2: USART init done!\n");

//     printf("Step 3: Initializing TIMER1...\n");
//     timer_config();
//     printf("Step 4: TIMER1 init done!\n");

//     printf("Step 5: Entering main loop...\n");
//     while (1)
//     {
//         if (timer_count >= 100)
//         {
//             timer_count = 0;
//             printf("Timer interrupt working! Count: %lu\n", timer_count);
//         }
//     }
// }
